### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [106]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
hop = "//Users//deankleto//Desktop//pandas-challenge-master//**HeroesOfPymoli**//purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
hop_df = pd.read_csv(hop)

## Player Count

* Display the total number of players

In [107]:
clean_hop_df = hop_df["SN"].drop_duplicates().count()
clean_hop_df

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [108]:
unique_items = hop_df["Item Name"].drop_duplicates().count()
unique_items

179

In [109]:
average_price = hop_df["Price"].mean()
average_price

3.050987179487176

In [110]:
total_purchases = hop_df["Item ID"].count()
total_purchases

780

In [111]:
total_rev = hop_df["Price"].sum()
total_rev

2379.77

In [112]:
###Not sure why this is erroring out.. worked on my other workbook, but when I copy pasted, throws an error..###

summary_purchasing = pd.DataFrame({"Number of Unique Items": unique_items,
                                  "Average Price": average_price,
                                  "Number of Purchases": total_purchases,
                                  "Total Revenue": total_rev
                                  }) 
                                  
summary_purchasing()

ValueError: If using all scalar values, you must pass an index

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [113]:
gender = hop_df["Gender"].value_counts()

gender_demographics_table = pd.DataFrame({"Count": gender,
                                    "Percentage": (gender/780)*100
                                     })


gender_demographics_table.head()

                       Count  Percentage
Male                     652   83.589744
Female                   113   14.487179
Other / Non-Disclosed     15    1.923077


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [114]:
grouped_hop_df = hop_df.groupby(['Gender'])

print(grouped_hop_df)

grouped_hop_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x1176b1518>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [115]:
grouped_hop_df["Item ID"].count()
purchase_count = grouped_hop_df["Item ID"].count()

In [116]:
grouped_hop_df["Price"].mean()
avg_purchase = grouped_hop_df["Price"].mean()

In [117]:
grouped_hop_df["Price"].sum()
total_purchase = grouped_hop_df["Price"].sum()

In [118]:
avg_gender_df = print(total_purchase/purchase_count)

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
dtype: float64

In [119]:
gender_analysis_table = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": avg_purchase,
                                     "Total Purchase Value": total_purchase,
                                      "Average Purchase by Gender": (total_purchase/purchase_count)*100
                                     })

gender_analysis_table.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase by Gender
Gender,,,,
Female,113,3.203009,361.94,320.300885
Male,652,3.017853,1967.64,301.785276
Other / Non-Disclosed,15,3.346000,50.19,334.600000

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [139]:
age_df = hop_df.head()

In [140]:
df = pd.DataFrame(age_df)

In [141]:
bins = [0, 9, 13, 19, 24, 29, 34, 39, 100]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+",]

In [142]:
df["Age Bracket"] = pd.cut(df["Age"], bins, labels=group_names)

df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bracket
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [143]:
df = df.groupby("Age Bracket")
df.sum()

             Purchase ID  Age  Item ID  Price
Age Bracket
<10                    0    0        0   0.00
10-14                  0    0        0   0.00
15-19                  0    0        0   0.00
20-24                  9   91      431  13.12
25-29                  0    0        0   0.00
30-34                  0    0        0   0.00
35-39                  0    0        0   0.00
40+                    1   40      143   1.56

In [ ]:
###Not sure where my error(s) is(are) for why my bins do not have the correct values###

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [144]:
grouped_age_df = hop_df.groupby(['Age'])

print(grouped_age_df)

grouped_age_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x1176b18d0>

     Purchase ID  SN  Gender  Item ID  Item Name  Price
Age
7              9   9       9        9          9      9
8              8   8       8        8          8      8
9              6   6       6        6          6      6
10             9   9       9        9          9      9
11             7   7       7        7          7      7
12             6   6       6        6          6      6
13             4   4       4        4          4      4
14             2   2       2        2          2      2
15            35  35      35       35         35     35
16            30  30      30       30         30     30

In [145]:
grouped_age_df["Item ID"].count()
purchase_count = grouped_age_df["Item ID"].count()

In [146]:
grouped_age_df["Price"].mean()
avg_purchase = grouped_age_df["Price"].mean()

In [147]:
grouped_age_df["Price"].sum()
total_purchase = grouped_age_df["Price"].sum()

In [148]:
avg_age_df = print(total_purchase/purchase_count)

Age
7     3.654444
8     3.246250
9     3.045000
10    3.536667
11    2.684286
12    2.633333
13    2.362500
14    3.455000
15    3.018571
16    3.018667
17    2.930909
18    3.162308
19    3.042609
20    3.174949
21    2.915161
22    2.955000
23    3.013881
24    3.137612
25    3.083051
26    2.870714
27    2.723000
28    1.690000
29    2.710000
30    3.152000
31    3.435714
32    2.836250
33    2.486429
34    2.458889
35    3.716429
36    2.532000
37    3.644286
38    3.794444
39    3.886667
40    2.785000
41    3.270000
42    3.930000
43    4.000000
44    2.680000
45    1.700000
dtype: float64

In [149]:
age_analysis_table = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": avg_purchase,
                                     "Total Purchase Value": total_purchase,
                                      "Average Purchase per Person": (total_purchase/purchase_count)*100
                                     })

age_analysis_table.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase per Person
Age,,,,
7,9,3.654444,32.89,365.444444
8,8,3.246250,25.97,324.625000
9,6,3.045000,18.27,304.500000
10,9,3.536667,31.83,353.666667
11,7,2.684286,18.79,268.428571

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [122]:
grouped_sn_df = hop_df.groupby(['SN'])

print(grouped_sn_df)

grouped_sn_df.count().head(5)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x1176b1048>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Adastirin33             1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1

In [123]:
grouped_sn_df["Purchase ID"].count()
purchase_count = grouped_sn_df["Purchase ID"].count()

In [124]:
grouped_sn_df["Price"].mean()
avg_purchase = grouped_sn_df["Price"].mean()

In [125]:
grouped_sn_df["Price"].sum()
total_purchase = grouped_sn_df["Price"].sum()

In [126]:
avg_purchase_df = print(total_purchase/purchase_count)

SN
Adairialis76       2.280000
Adastirin33        4.480000
Aeda94             4.910000
Aela59             4.320000
Aelaria33          1.790000
Aelastirin39       3.645000
Aelidru27          1.090000
Aelin32            2.993333
Aelly27            3.395000
Aellynun67         3.740000
Aellyria80         3.080000
Aelollo59          2.815000
Aenarap34          2.960000
Aeral43            4.400000
Aeral68            4.000000
Aeral97            4.800000
Aeralria27         4.090000
Aeralstical35      2.960000
Aeri84             1.610000
Aerillorin70       3.330000
Aerithllora36      4.320000
Aerithnucal56      4.400000
Aerithnuphos61     4.910000
Aerithriaphos45    1.560000
Aerithriaphos46    2.180000
Aesri53            1.760000
Aesty53            1.955000
Aestysu37          2.690000
Aesur96            2.210000
Aesurstilis64      1.030000
                     ...
Undosia27          3.770000
Undosian34         4.150000
Undotesta33        4.740000
Wailin72           2.730000
Yadacal26          3.270000
Yadaisuir65        4.090000
Yadam35            2.480000
Yadanu52           2.380000
Yadaphos40         2.675000
Yalae81            3.345000
Yalaeria91         1.060000
Yaliru88           3.030000
Yalo85             3.650000
Yalostiphos68      4.400000
Yana46             3.550000
Yarithllodeu72     3.750000
Yarithrgue83       3.450000
Yarithrin84        4.140000
Yarithsurgue62     4.940000
Yarolwen77         4.430000
Yasrisu92          3.440000
Yastyriaphos75     4.750000
Yasur35            4.480000
Yasur85            1.100000
Yathecal72         3.460000
Yathecal82         2.073333
Yathedeu43         3.010000
Yoishirrala98      4.580000
Zhisrisu83         3.945000
Zontibe81          2.676667
Length: 576, dtype: float64

In [127]:
top_spenders_table = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": avg_purchase,
                                     "Total Purchase Value": total_purchase,
                                      }) 
                                    

top_spenders_table.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [128]:
#Sorting Top 5 Spenders
sn_df = top_spenders_table.sort_values("Total Purchase Value", ascending=False)
sn_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [129]:
grouped_top_data = hop_df.groupby(['Item ID', 'Item Name'])

grouped_top_data.count().head()

                            Purchase ID  SN  Age  Gender  Price
Item ID Item Name
0       Splinter                      4   4    4       4      4
1       Crucifer                      3   3    3       3      3
2       Verdict                       6   6    6       6      6
3       Phantomlight                  6   6    6       6      6
4       Bloodlord's Fetish            5   5    5       5      5

In [130]:
grouped_top_data["Purchase ID"].count()
purchase_count = grouped_top_data["Purchase ID"].count()

In [131]:
grouped_top_data["Price"].mean()
avg_purchase = grouped_top_data["Price"].mean()

In [132]:
grouped_top_data["Price"].sum()
total_purchase = grouped_top_data["Price"].sum()

In [133]:
top_purchased_table = pd.DataFrame({"Purchase Count": purchase_count,
                                    "Average Purchase Price": avg_purchase,
                                     "Total Purchase Value": total_purchase,
                                      }) 
                                    

top_purchased_table.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.28,5.12
1,Crucifer,3,3.26,9.78
2,Verdict,6,2.48,14.88
3,Phantomlight,6,2.49,14.94
4,Bloodlord's Fetish,5,1.70,8.50

In [134]:
#Sorting Top 5 Popular
popular_df = top_purchased_table.sort_values("Purchase Count", ascending=False)
popular_df.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [135]:
#Sorting Top 5 Profitable
profitable_df = top_purchased_table.sort_values("Total Purchase Value", ascending=False)
profitable_df.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80